In [1]:
import pandas as pd

In [2]:
# 自己创建DataFrame
data = {'country':['aaa','bbb','ccc'],
       'areacode':[100,200,300]}
df = pd.DataFrame(data)

In [3]:
df.info

<bound method DataFrame.info of   country  areacode
0     aaa       100
1     bbb       200
2     ccc       300>

### 基本的数据操作

In [4]:
df_new = pd.read_csv('titanic.csv')

In [5]:
df_new.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
# 取出Age列 NaN代表不是一个数字
age = df_new['Age']
age

In [ ]:
age[:3]

In [ ]:
type(age) #一行或者一列都是Series结构

In [ ]:
age.index

In [ ]:
age.values[:3]

In [ ]:
# 拿名字做索引，注意需要重新接收
df_new_index = df_new.set_index('Name')

In [ ]:
df_new_index.head()

In [ ]:
"""
有了新索引就可以直接拿这个索引取值了
"""
age_series = df_new_index['Age']
age_series[:5]

In [ ]:
age_series['Allen, Mr. William Henry']

In [ ]:
# 可以做些运算，注意重新接收，不会影响旧值
age_series_new = age_series[:5] * 10
age_series_new

In [ ]:
age_series[:5] #可以看出对旧值没有影响

In [ ]:
# 还可以求一些统计的值
df_new.describe()

In [6]:
# 还可以求一些统计的值
df_new.describe()

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [7]:
age[:3]

0    22.0
1    38.0
2    26.0
Name: Age, dtype: float64

In [8]:
type(age) #一行或者一列都是Series结构

pandas.core.series.Series

In [9]:
age.index

RangeIndex(start=0, stop=891, step=1)

In [10]:
age.values[:3]

array([22., 38., 26.])

In [19]:
# 拿名字做索引，注意需要重新接收
df_new_index = df_new.set_index('Name')

In [20]:
df_new_index.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
"""
有了新索引就可以直接拿这个索引取值了
"""
age_series = df_new_index['Age']
age_series[:5]

Name
Braund, Mr. Owen Harris                                22.0
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    38.0
Heikkinen, Miss. Laina                                 26.0
Futrelle, Mrs. Jacques Heath (Lily May Peel)           35.0
Allen, Mr. William Henry                               35.0
Name: Age, dtype: float64

In [28]:
age_series['Allen, Mr. William Henry']

35.0

In [30]:
# 可以做些运算，注意重新接收，不会影响旧值
age_series_new = age_series[:5] * 10
age_series_new

Name
Braund, Mr. Owen Harris                                220.0
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    380.0
Heikkinen, Miss. Laina                                 260.0
Futrelle, Mrs. Jacques Heath (Lily May Peel)           350.0
Allen, Mr. William Henry                               350.0
Name: Age, dtype: float64

In [31]:
age_series[:5] #可以看出对旧值没有影响

Name
Braund, Mr. Owen Harris                                22.0
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    38.0
Heikkinen, Miss. Laina                                 26.0
Futrelle, Mrs. Jacques Heath (Lily May Peel)           35.0
Allen, Mr. William Henry                               35.0
Name: Age, dtype: float64

In [35]:
# 还可以求一些统计的值
df_new.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200